{
  "events": [{
    "datetime": "2025-03-16T18:30:00",
    "location": "in the Function Room",
    "description": null
  }],
  "characters": [
    {"name": "Gomez Addams", "gender": "male", "age": "35-55", "description": "A suave man of Spanish descent who adores his wife and children and takes immense pride in being an Addams. Gomez finds himself trapped between his daughter and his wife, being forced to hide Wednesday’s big secret from Morticia. He has great comedic timing and is a strong dancer. Suggested songs to focus on: [Trapped](https://www.youtube.com/watch?v=By-eLmmNAps&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=5) or [Not Today](https://www.youtube.com/watch?v=O2F6heHPMCU&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=25)"},
    {"name": "Morticia Addams", "gender": "female", "age": "35-55", "description": "The darkly mysterious matriarch of the Addams family who believes strongly in family tradition. Morticia is unnerved thinking that Gomez is hiding something from her. She is confident and poised with a side of dry wit. Tango skills a plus! Her movements are understated but her look can speak volumes. Suggested songs to focus on: [Just Around the Corner](https://www.youtube.com/watch?v=jijqmzdgEYA)"},
    {"name": "Wednesday Addams", "gender": "female", "age": "18-22", "description": "Gothic big sister Wednesday who has her father’s heart and her mother’s sensibility falls in love with a “normal” boy whom she brings home to meet the family. Wednesday is trying to balance her relationships with her “strange” family with that of her new love and his “normal” family. Wednesday showcases compassion, a bit of stubbornness and strong will. She has a strong singing voice. Suggested songs to focus on: [Pulled](https://www.youtube.com/watch?v=MDU9FLNBKD4&t=2s), [Crazier Than You Part 1](https://www.youtube.com/watch?v=hFENFXmQplo&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=23)"},
    {"name": "Pugsley Addams", "gender": "male", "age": "12-16", "description": "The youngest of the Addams Family, Pugsley loves to be tortured by his big sister. He is lost trying to figure out his place now that she has a new boyfriend and family dynamics are changing. Pugsley is funny, mischievous and teasing. Don’t be put off by solo singing, it’s more important to convey the role! Suggested song to focus on: [What If Part 1](https://www.youtube.com/watch?v=ipa8-4_WO54&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=13)"},
    {"name": "Uncle Fester", "gender": "male", "age": "35-60", "description": "Serving as the narrator of the show, Uncle Fester is lovable, childish, enthusiastic and highly incorrigible. Fester has great comedic timing and a tenor voice. Physical humour and playing with the audience is a must ....Ukulele skills a plus! Suggested songs to focus on: [The Moon and Me](https://www.youtube.com/watch?v=Gfw2lT0Ng0k&t=4s)"},
    {"name": "Grandma", "gender": "female", "age": "102", "description": "Fun, quirky and feisty, Grandma always has a trick up her sleeve. Grandma is wise, wacky and sometimes a bit crass. She has great comedic timing and physicality. Don’t be put off by solo singing, it’s more important to convey the role! Suggested song to focus on: [When You're an Addams](https://www.youtube.com/watch?v=qo1gAJokgrw&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=1)"},
    {"name": "Lurch", "gender": "male", "age": "25–60", "description": "A man of few words, Lurch is the Addams Family butler. His unmistakable commanding presence is accented by grunts, moans and deliberate movement. Must have great non-verbal story-telling abilities (think: facial expressions and sound). Lurch has a rich bass voice but we may play with the song, so solo singing not necessarily essential – conveying the role is much more important! Suggested song to focus on: [Move Toward the Darkness](https://www.youtube.com/watch?v=kDhLjTQMHk4&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=27)"},
    {"name": "Mal Beinecke", "gender": "male", "age": "35-55", "description": "The uptight father of Lucas and cold-shouldered husband to Alice, cynical Mal meets the Addams with scepticism. He finds the Addams to be too bizarre for his liking and cannot fathom being related to them. Suggested song to focus on: [Crazier Than You Part 2](https://www.youtube.com/watch?v=XQyxQMddjI4&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=24)"},
    {"name": "Alice Beinecke", "gender": "female", "age": "35-55", "description": "Lucas’s mother and Mal’s wife, Alice is strongly devoted to her family. She presents herself as reserved and collected (even when speaking in rhyme) until she learns to unleash her wild side at dinner with the Addams. She is a strong comedic actress with an ability to really sell a song! We may play ‘Waiting ‘ in a new way – so just show us what you’ve got! Suggested song to focus on: [Waiting](https://www.youtube.com/watch?v=70liF4N6D9E&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=16)"},
    {"name": "Lucas Beinecke", "gender": "male", "age": "18-22", "description": "The hopeful romantic and son of Alice & Mal, Lucas has fallen in love with Wednesday and intends to marry her. He is optimistic and hopeful yet struggles to find the balance between his ‘normal’ family and the macabre Addams. Suggested song to focus on: [Crazier Than You Part 1](https://www.youtube.com/watch?v=hFENFXmQplo&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=23)"},
    {"name": "The Ancestors (The Ensemble)", "gender": "any", "age": "any", "description": "All Vocal Ranges, The Addams’ ancestors from various eras serve as the chorus for the show and help bring the story to life. They will be featured singing, dancing, acting, creating the settings and scenery throughout the entire show (once released from the family crypt!). Seeking actors with vocals, acting and dancing abilities but not necessarily all three! Character performing is key! Suggested Addams Family audition song: [When You're an Addams](https://www.youtube.com/watch?v=qo1gAJokgrw&list=PLN20oJoJil0RdrbEA6CWoAxXssFu-AYGu&index=1)"}
  ]
}
