[
  {
    "name": "A Bunch of Amateurs",
    "location": "Main House",
    "start": "2023-03-28",
    "end": "2023-04-08",
    "about": "A Bunch of Amateurs Written by Nick Newman & Ian Hislop, Directed by GUEST DIRECTOR\n\nKeen to boost his flagging career, fading Hollywood action hero Jefferson Steele arrives in England to play King Lear in Stratford – only to find that this is not the birthplace of the Bard, but a sleepy Suffolk village. And instead of Kenneth Branagh and Dame Judi Dench, the cast are a bunch of amateurs trying to save their theatre from developers. Jefferson’s monstrous ego, vanity and insecurity are tested to the limit by the enthusiastic am-dram thespians. As acting worlds collide and Jefferson’s career implodes, he discovers some truths about himself – along with his inner Lear! A laugh a minute comedy about actors brought to you by Ian Hislop (Private Eye, Have I got News for you).",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2023/01/03BunchofamateursA4-scaled.jpg"
  },
  {
    "name": "MacBeth",
    "location": "Main House",
    "start": "2023-05-02",
    "end": "2023-05-13",
    "about": "Macbeth Written by William Shakespeare, Directed by Dodie Browne\n\n\"Things bad begun make strong themselves by ill\".\nShakespeare’s shortest play has been seen in many styles and settings, and we invite you to travel back to a time of battles and shifting power where three spirits of natural elements, weavers of the fates in witch form, foretell the rise of one Macbeth, but at what cost? Murders of a monarch, a friend and the family of a challenger all lead to madness and tragedy.\n\"By the pricking of my thumbs, something wicked this way comes\"",
    "imageurl":"https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2023/01/04macbethA4-scaled.jpg"
  },
  {
    "name": "Colder Than Here",
    "location": "Main House",
    "start": "2023-02-21",
    "end": "2023-03-04",
    "about": "Colder than Here Written by Laura Wade, Directed by Elodie Bass\n\nMyra may be dying of cancer, but she’s hardly going to let that dampen her spirit. Instead, she decides to face things head on, planning out her own end while trying to fix the relationships between her husband, Alec, and daughters, Harriet and Jenna. As each family member struggles to cope with Myra’s illness, they find themselves drawn closer through moments of emotion, vulnerability, support, and surprising humor. Though a play about cancer, Laura Wade’s Colder Than Here finds opportunities for joy and laughter—a testament to family, relationships and finding light even in the darkest of times.",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655024193589-m.png",
    "trailer": "aJhZx0_hytA"
  },
  {
    "name": "Oliver!",
    "location": "Main House",
    "start": "2023-06-14",
    "end": "2023-06-30",
    "trailer": "dZjsa4dTqUE",
    "soldout": true,
    "about": "it's really good, you should see it!",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2021/12/06_Oliver.jpg?resize=620%2C877"
  },
  {
    "name": "Lend me a Tenor",
    "location": "Main House",
    "start": "2022-08-01",
    "end": "2022-08-20",
    "about": "it's really good, you should see it!",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2021/12/07_tenors.jpg?resize=724%2C1024"
  },
  {
    "name": "A fistful of Tenors",
    "location": "The Studio",
    "start": "2023-09-14",
    "end": "2023-09-30",
    "about": "it's really good, you should see it!",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2021/12/05_Thalia.jpg?resize=724%2C1024"
  },
  {
    "name": "For a few Tenors more",
    "location": "Digital",
    "start": "2024-06-14",
    "end": "2024-06-30",
    "about": "it's really good, you should see it!",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2021/12/08_pressure.jpg?resize=724%2C1024"
  },
  {
    "name": "The Play with the ridiculously long name to test the limits of the layout. No, seriously, it's just silly now.",
    "location": "Unknown",
    "start": "2025-06-14",
    "end": "2025-06-30",
    "about": "it's really good, you should see it!",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2021/12/08_pressure.jpg?resize=724%2C1024"
  }
]
