[
  {
    "name": "Colder Than Here",
    "location": "Main House",
    "start": "2023-02-21",
    "end": "2023-03-04",
    "about": "Colder than Here Written by Laura Wade, Directed by Elodie Bass\n\nMyra may be dying of cancer, but she’s hardly going to let that dampen her spirit. Instead, she decides to face things head on, planning out her own end while trying to fix the relationships between her husband, Alec, and daughters, Harriet and Jenna. As each family member struggles to cope with Myra’s illness, they find themselves drawn closer through moments of emotion, vulnerability, support, and surprising humor. Though a play about cancer, Laura Wade’s Colder Than Here finds opportunities for joy and laughter—a testament to family, relationships and finding light even in the darkest of times.",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655024193589-m.png",
    "trailer": "aJhZx0_hytA"
  },
  {
    "name": "A Bunch of Amateurs",
    "location": "Main House",
    "start": "2023-03-28",
    "end": "2023-04-08",
    "about": "A Bunch of Amateurs Written by Nick Newman & Ian Hislop, Directed by GUEST DIRECTOR\n\nKeen to boost his flagging career, fading Hollywood action hero Jefferson Steele arrives in England to play King Lear in Stratford – only to find that this is not the birthplace of the Bard, but a sleepy Suffolk village. And instead of Kenneth Branagh and Dame Judi Dench, the cast are a bunch of amateurs trying to save their theatre from developers. Jefferson’s monstrous ego, vanity and insecurity are tested to the limit by the enthusiastic am-dram thespians. As acting worlds collide and Jefferson’s career implodes, he discovers some truths about himself – along with his inner Lear! A laugh a minute comedy about actors brought to you by Ian Hislop (Private Eye, Have I got News for you).",
    "imageurl": "https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2023/01/03BunchofamateursA4-scaled.jpg"
  },
  {
    "name": "Macbeth",
    "location": "Main House",
    "start": "2023-05-02",
    "end": "2023-05-13",
    "about": "Macbeth Written by William Shakespeare, Directed by Dodie Browne\n\n\"Things bad begun make strong themselves by ill\".\nShakespeare’s shortest play has been seen in many styles and settings, and we invite you to travel back to a time of battles and shifting power where three spirits of natural elements, weavers of the fates in witch form, foretell the rise of one Macbeth, but at what cost? Murders of a monarch, a friend and the family of a challenger all lead to madness and tragedy.\n\"By the pricking of my thumbs, something wicked this way comes\"",
    "imageurl":"https://i0.wp.com/www.archwaytheatre.com/wp-content/uploads/2023/01/04macbethA4-scaled.jpg"
  },
  {
    "name": "Sheila's Island",
    "location": "Main House",
    "start": "2023-06-06",
    "end": "2023-06-17",
    "about": "Sheila's Island by Tim Firth, Directed by Eddie Redfern",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-1678116719322-m.png"
  },
  {
    "name": "The Rocky Monster Show",
    "location": "Main House",
    "start": "2023-06-22",
    "end": "2023-06-24",
    "about": "This is our Youth Workshop production for 2023.",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16768261661373-m.png"
  },
  {
    "name": "Little Shop of Horrors",
    "location": "Main House",
    "start": "2023-07-18",
    "end": "2023-07-29",
    "about": "Little Shop of Horrors Written by Howard Ashman, Directed by Millie O'Ryan-Bristow\n\nLittle Shop of Horrors, a comedy horror rock musical about a florist, Seymour Krelborn who works at Mushnik’s Florist Shop in a run-down neighbourhood in New York City referred to as Skid Row. When the meek florist stumbles across a rare and unidentifiable plant that feeds on human blood and flesh, he becomes an overnight sensation, naming it Audrey II to impress glamorous Audrey, the colleague he’s secretly in love with. A succulent musical, written by Howard Ashman with music by Alan Menken. Be prepared to laugh, scream and give up gardening for good!\n\nPLEASE NOTE. Strobe lights will be used during this production.",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655024654928-m.png"
  },
  {
    "name": "Wyrd Sisters",
    "location": "Main House",
    "start": "2023-08-22",
    "end": "2023-09-02",
    "about": "Wyrd Sisters Written by Terry Prachett, Directed by Gary Andrews\n\nFollowing on from the success of ‘Mort’ in the Studio back in 2019, this is the first Terry Pratchett play to be staged in the Main House: Three witches have gathered on a lonely heath. A king has been cruelly murdered, his throne usurped by his ambitious cousin. An infant heir and the crown of the kingdom, both missing . . .Witches don’t have these kind of dynastic problems themselves – in fact, they don’t have leaders.\n\nGranny Weatherwax was the most highly-regarded of the leaders the witches don’t have. But even she found that meddling in royal politics was a lot more complicated than certain playwrights would have you believe . .\nFunny and profound in equal measures – this is definitely not to be missed.",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655026836388-m.png"
  },
  {
    "name": "The Actress",
    "location": "Main House",
    "start-time": "7:45pm",
    "start": "2023-09-26",
    "end": "2023-10-07",
    "about": "The Actress Written by Peter Quilter, Directed by Carol Hall\n\nA funny and poignant new comedy, dramatising the events backstage as a colourful, complicated actress makes her farewell performance, while dealing with unexpected visitors... Drama and comedy collide as people say their goodbyes, declare their love, roar with laughter, spit insults, grab a final embrace, and renew old battles. The play is full of witty dialogue that is also philosophically profound...A smart, intelligent and very amusing play.",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655026004853-m.png"
  },
  {
    "name": "Saucy Jack and the Space Vixens",
    "location": "Main House",
    "start-time": "7:45pm",
    "start": "2023-10-31",
    "end": "2023-11-11",
    "about": "Saucy Jack and the space Vixens Written by Charlotte Mann & Michael Fidler, Music by Jonathan Croose & Robin Forrest, Directed by Felicity Westmacott\n\nThe show is set in a seedy cabaret bar on the planet Frottage III — presided over by the alluring and charismatic Saucy Jack himself. All is not well — danger lurks in every corner as the cabaret acts are being picked off by a serial killer. As the show begins Vulva Savannah, promising entertainer and torch-song singer, has just become the latest victim of the Slingback Killer. The Space Vixens arrive to solve the mystery — interstellar, super-fashion crime fighters here to save the day by the Power of Disco! They hit the ground singing with the explosive house anthem Glitter Boots Saved My Life. If you like the Rocky Horror Show, you will LOVE Saucy Jack and the plans for this show will be like nothing you've seen before on the Archway Stage so dont miss out!",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655025593008-m.png"
  },
  {
    "name": "Blackadder",
    "location": "Main House",
    "start-time": "7:45pm",
    "start": "2023-12-05",
    "end": "2023-12-16",
    "about": "Blackadder Written by Richard Curtis and Ben Elton, Directed by Geoff Dartnell\n\nThe Archway theatre has a “cunning plan” to bring Blackadder II to Horley!\nThe second series of the sitcom aired on the BBC over 35 years ago. Set in England during the reign of Queen Elizabeth I, it sees the principal character, Edmund, Lord Blackadder, as a Tudor courtier attempting to win the favour of the Queen whilst being thwarted at every turn by rivals and incompetent friends.\n\nThe Archway is presenting three episodes of Blackadder’s attempts to better his position and restore his fortune, only to be de-railed in every case! In ‘Bells’ his marriage plans take an unexpected turn, whilst in ‘Beer’ his chance of an inheritance falls foul of a drinking competition. In ‘Chains’ his heroism is short-lived in a final showdown with an evil Prince.\n\nJoin us for a festive fortnight of merriment and start your Christmas with a rousing helping of Blackadder, Baldrick, Queenie, Nursie, Melchit and Percy, not forgetting Lord Flasheart and…..BOB !!",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16655023787112-m.png"
  },
  {
    "name": "Dingbats Improv Jam",
    "location": "The Studio",
    "start-time": "7:45pm",
    "start": "2023-10-17",
    "end": "2023-10-17",
    "about": "March Dingbats Improv Jam\n\nThe Archway Theatre and Dingbats Improv presents an evening of fun improvised games, scenes, and stories all made up on the spot.\n\nThe first half will feature performances from special guest improv acts and the second half will be an improv jam.\n\nIn an improv jam anyone who wants to can jump on stage with other improvisers and have fun making up scenes and stories together. Of course, you can have a fun evening out and enjoy watching without performing.\n\nThe bar in the function room will be open.\n\nSuitable for ages 16+",
    "imageurl": "https://cdn.ticketsource.co.uk/images/promoter/banner/01138-16772736452211-m.png",
    "image-no-stretch": true
  }
]
